#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.backend_vms[0] will be created
  + resource "google_compute_instance" "backend_vms" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "g1-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
      + name                    = "vm0"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          + network_ip         = (known after apply)
          + subnetwork         = "test-subnetwork"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.backend_vms[1] will be created
  + resource "google_compute_instance" "backend_vms" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "g1-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
      + name                    = "vm1"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          + network_ip         = (known after apply)
          + subnetwork         = "test-subnetwork"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.backend_vms[2] will be created
  + resource "google_compute_instance" "backend_vms" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "g1-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
      + name                    = "vm2"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          + network_ip         = (known after apply)
          + subnetwork         = "test-subnetwork"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.database_vms[0] will be created
  + resource "google_compute_instance" "database_vms" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "g1-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
      + name                    = "vm0"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          + network_ip         = (known after apply)
          + subnetwork         = "test-subnetwork"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.database_vms[1] will be created
  + resource "google_compute_instance" "database_vms" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "g1-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
      + name                    = "vm1"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          + network_ip         = (known after apply)
          + subnetwork         = "test-subnetwork"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.database_vms[2] will be created
  + resource "google_compute_instance" "database_vms" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "g1-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
      + name                    = "vm2"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          + network_ip         = (known after apply)
          + subnetwork         = "test-subnetwork"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance_group.backendig must be replaced
-/+ resource "google_compute_instance_group" "backendig" {
      ~ description = "frontendig" -> "backendig" # forces replacement
      ~ id          = "projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/backendig" -> (known after apply)
      ~ instances   = [] -> (known after apply)
        name        = "backendig"
        network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      ~ project     = "svg-devops-training-2" -> (known after apply)
      ~ self_link   = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/backendig" -> (known after apply)
      ~ size        = 0 -> (known after apply)
        zone        = "europe-north1-a"

      + named_port {
          + name = "http"
          + port = 8080
        }
      + named_port {
          + name = "https"
          + port = 8443
        }
    }

  # google_compute_instance_group.databaseig will be updated in-place
  ~ resource "google_compute_instance_group" "databaseig" {
        description = "databaseig"
        id          = "projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/databaseig"
      ~ instances   = [] -> (known after apply)
        name        = "databaseig"
        network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
        project     = "svg-devops-training-2"
        self_link   = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/databaseig"
        size        = 0
        zone        = "europe-north1-a"

      + named_port {
          + name = "http"
          + port = 8080
        }
      + named_port {
          + name = "https"
          + port = 8443
        }
    }

Plan: 7 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
